{
    "OriginalInput1":"the longest list of the longest stuff at the longest domainname at long last . com",
    "NoSpaceInput1":"thelongestlistofthelongeststuffatthelongestdomainnameatlonglast.com,",
    "OriginalInput2": "Listen to someone speaking English. Do you hear any spaces between words? There are spaces, of course, but their function is not to mark word boundaries. They may demark episodes in a narrative, they may indicate hesitation or uncertainty, they may announce a particularly dramatic point in the narrative, etc. Now, the question as posed indicates, once again, that most people don’t know the difference between speech and writing. Written English is a visible representation of English speech; it is generally an adequate representation, especially with punctuation, because people who know the system can reproduce the written text in speech which is close to the original delivery.",
    "NoSpaceInput2": "ListentosomeonespeakingEnglish.Doyouhearanyspacesbetweenwords?Therearespaces,ofcourse,buttheirfunctionisnottomarkwordboundaries.Theymaydemarkepisodesinanarrative,theymayindicatehesitationoruncertainty,theymayannounceaparticularlydramaticpointinthenarrative,etc.Now,thequestionasposedindicates,onceagain,thatmostpeopledon'tknowthedifferencebetweenspeechandwriting.WrittenEnglishisavisiblerepresentationofEnglishspeech;itisgenerallyanadequaterepresentation,especiallywithpunctuation,becausepeoplewhoknowthesystemcanreproducethewrittentextinspeechwhichisclosetotheoriginaldelivery.",
    "OriginalInput3": "Languages have been written in many different ways, starting with direction of writing. Left to right, right to left, left to right in the first line, right to left in the second line, back to right to left in the third line, etc. This style of writing is called ‘boustrophedon,’ meaning ‘as an ox ploughs,’ that is, turning at the end of the line and ploughing back to the starting point. That is actually an economical way to write and read, since it is easier to move the gaze to the correct following line. You can also write from top to bottom, or bottom to top, starting on either the left side of the page or the right. You can also start at the center of a circle and move around and around in an ever widening circle, or the reverse of this. All of these have been used either routinely or for special effect in one language or another. Many languages are written without word division, something which readers in the European tradition do not like and which they feel that they need; yet there are many Greek and Latin inscriptions and manuscripts which are written without word division.",
    "NoSpaceInput3": "Languageshavebeenwritteninmanydifferentways,startingwithdirectionofwriting.Lefttoright,righttoleft,lefttorightinthefirstline,righttoleftinthesecondline,backtorighttoleftinthethirdline,etc.Thisstyleofwritingiscalledboustrophedon,meaningasanoxploughs,thatis,turningattheendofthelineandploughingbacktothestartingpoint.Thatisactuallyaneconomicalwaytowriteandread,sinceitiseasiertomovethegazetothecorrectfollowingline.Youcanalsowritefromtoptobottom,orbottomtotop,startingoneithertheleftsideofthepageortheright.Youcanalsostartatthecenterofacircleandmovearoundandaroundinaneverwideningcircle,orthereverseofthis.Allofthesehavebeenusedeitherroutinelyorforspecialeffectinonelanguageoranother.Manylanguagesarewrittenwithoutworddivision,somethingwhichreadersintheEuropeantraditiondonotlikeandwhichtheyfeelthattheyneed;yettherearemanyGreekandLatininscriptionsandmanuscriptswhicharewrittenwithoutworddivision.",
    "OriginalInput4": "In discussing language and its structure, it is extremely important not to confuse speech and writing, and worse, not to assume that the written form is basic, the spoken form, derived. Speech, maybe because of its long history of development, is infinitely superior to writing, which is recent and far from a perfect representation of speech. Do discuss either or both, but do not confuse and mix the two!",
    "NoSpaceInput4": "IndiscussinglanguageanditsstructureitisextremelyimportantnottoconfusespeechandwritingandworsenottoassumethatthewrittenformisbasicthespokenformderivedSpeechmaybebecauseofitslonghistoryofdevelopmentisinfinitelysuperiortowritingwhichisrecentandfarfromaperfectrepresentationofspeechDodiscusseitherorbothbutdonotconfuseandmixthetwo"
}